app/controllers/faqs_controller.rb

SELECT "faqs".* FROM "faqs"
---
  def index
    @faqs = Faq.all

INSERT INTO "faqs" ("question", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @faq = Faq.new(faq_params)

    respond_to do |format|
      if @faq.save

DELETE FROM "faqs" WHERE "faqs"."id" = ?  [["id", 3]]
---
  def destroy
    @faq.destroy

SELECT "faqs".* FROM "faqs" WHERE "faqs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_faq
      @faq = Faq.find(params[:id])