app/controllers/welcome_controller.rb

SELECT "faqs".* FROM "faqs"
---
  def index
      if current_user
             redirect_to faqs_path
      end
      @faqs = Faq.all